x = -38
print('дратути!')
if x < 0:
    print('Меньше нуля')
print('дотвидания!')

# примеры
a, b = 10, 5

if a > b:
    print('a > b')

if a > b and a > 0:
    print('успех14')

if (a > b) and (a > 0 or b < 1000):
    print('успех17')

if 4 < b and b <10:
    print('успех20')

# можно сравнивать - числа, строки, списки, вообще -
if '34' > '123':
    print('успех24')

if '123' > '12':
    print('успех27')

if [1, 2] > [1, 1]:
    print('успех30')

# что нельзя сравнивать - разные типы
if '6' > 5:
    print('успех')

if [5, 6] > 5:
    print('успех')

# но
if '6' != 5:
    print('uspeh41')